class AppLanguagesText {
  static final Map<String, String> ar = {
    //On Boarding
    "انطلق في رحلة سيارتك مع قائمة السيارات":
        "انطلق في رحلة سيارتك مع قائمة السيارات",
    "اكتشف سيارتك المثالية مع قائمة السيارات":
        "اكتشف سيارتك المثالية مع قائمة السيارات",
    "خدماتنا متميزة ومتنوعة": "خدماتنا متميزة ومتنوعة",
    "التالي": "التالي",
    "ابدأ": "ابدأ",

    //Home Page
    "التصنيفات المشهورة": "التصنيفات المشهورة",
    "أفضل مركباتنا المميزة": "أفضل مركباتنا المميزة",
    "الخدمات التي نقدّمها": "الخدمات التي نقدّمها",
    "شراء سيارة": "شراء سيارة",
    "نوع الخدمة: شراء سيارة\n": "نوع الخدمة: شراء سيارة\n",
    "بيع سيارة": "بيع سيارة",
    "نوع الخدمة: بيع سيارة\n": "نوع الخدمة: بيع سيارة\n",
    "تمويل بنكي": "تمويل بنكي",
    "نوع الخدمة: تمويل بنكي\n": "نوع الخدمة: تمويل بنكي\n",
    "تصدير سيارة": "تصدير سيارة",
    "نوع الخدمة: تصدير سيارة\n": "نوع الخدمة: تصدير سيارة\n",
    "تأمين/ تسجيل\n ضمان": "تأمين/ تسجيل\n ضمان",
    "نوع الخدمة: تأمين/تسجيل ضمان\n": "نوع الخدمة: تأمين/تسجيل ضمان\n",
    "طلب الخدمة": "طلب الخدمة",
    "في قائمة سيارة، نقدم مجموعة واسعة من السيارات المستعملة عالية الجودة لتلبية احتياجات قيادتك وميزانيتك. مع سنوات من الخبرة في صناعة السيارات، نفخر بتقديم خدمة عملاء استثنائية والتأكد من أن كل سيارة في قطعتنا تلبي معاييرنا الصارمة للجودة والموثوقية.":
        "في قائمة سيارة، نقدم مجموعة واسعة من السيارات المستعملة عالية الجودة لتلبية احتياجات قيادتك وميزانيتك. مع سنوات من الخبرة في صناعة السيارات، نفخر بتقديم خدمة عملاء استثنائية والتأكد من أن كل سيارة في قطعتنا تلبي معاييرنا الصارمة للجودة والموثوقية.",
    "بواسطة": "بواسطة",
    "الرئيسية": "الرئيسية",
    "السيارات": "السيارات",
    "معلومات عنا": "معلومات عنا",
    "خدماتنا": "خدماتنا",
    "مدوّنة": "مدوّنة",
    "اتّصال": "اتّصال",
    "تسجيل الدخول": "تسجيل الدخول",
    "اشتراك": "اشتراك",

    //Auth
    //
    //Login
    "اسم المستخدم": "اسم المستخدم",
    "كلمة المرور": "كلمة المرور",
    "ليس لديك حساب؟ ": "ليس لديك حساب؟ ",
    "أنقر هنا ": "أنقر هنا ",
    "للتسجيل": "للتسجيل",
    "هل نسيت كلمة المرور؟": "هل نسيت كلمة المرور؟",
    "تسجيل الدخول مع غوغل": "تسجيل الدخول مع غوغل",
    "تسجيل الدخول مع فيسبوك": "تسجيل الدخول مع فيسبوك",
    "التحقق من الحساب": "التحقق من الحساب",
    "الرجاء إدخال الحساب المراد استعادة كلمة المرور له في الحقل التالي:":
        "الرجاء إدخال الحساب المراد استعادة كلمة المرور له في الحقل التالي:",
    "أدخل الحساب هنا من فضلك...": "أدخل الحساب هنا من فضلك...",
    "إرسال الرمز ": "إرسال الرمز ",
    "إعادة تعيين كلمة المرور": "إعادة تعيين كلمة المرور",
    "كلمة المرور الجديدة:": "كلمة المرور الجديدة:",
    "أدخل كلمة المرور الجديدة هنا...": "أدخل كلمة المرور الجديدة هنا...",
    "تأكيد كلمة المرور:": "تأكيد كلمة المرور:",
    "أعد إدخال كلمة المرور الجديدة هنا...":
        "أعد إدخال كلمة المرور الجديدة هنا...",
    "إعادة التعيين": "إعادة التعيين",
    "تم تسجيل الدخول بنجاح": "تم تسجيل الدخول بنجاح",
    "الرجاء التحقق من صيغة البريد الإلكتروني":
        "الرجاء التحقق من صيغة البريد الإلكتروني",
    "إرسال الرمز مجدداً": "إرسال الرمز مجدداً",
    "تم إرسال رمز التحقق بنجاح": "تم إرسال رمز التحقق بنجاح",
    "تمت إعادة تعيين كلمة المرور بنجاح": "تمت إعادة تعيين كلمة المرور بنجاح",
    //
    //SignUp
    "البريد الإلكتروني": "البريد الإلكتروني",
    "تأكيد كلمة المرور": "تأكيد كلمة المرور",
    "هل لديك حساب؟ ": "هل لديك حساب؟ ",
    "لتسجيل الدخول": "لتسجيل الدخول",
    "رمز التحقق": "رمز التحقق",
    "التحقق من الرمز": "التحقق من الرمز",
    "الرجاء إدخال رمز التحقق الذي أرسلناه إلى حسابك في الحقل التالي:":
        "الرجاء إدخال رمز التحقق الذي أرسلناه إلى حسابك في الحقل التالي:",
    "تحقق من الرمز ": "تحقق من الرمز ",
    "جارٍ التحقق": "جارٍ التحقق",
    "لا يمكن لاسم المستخدم ان يكون فارغاً":
        "لا يمكن لاسم المستخدم ان يكون فارغاً",
    "لا يمكن للبريد الإلكتروني ان يكون فارغاً":
        "لا يمكن للبريد الإلكتروني ان يكون فارغاً",
    "لا يمكن لكلمة المرور أن تكون أصغر من 8 خانات":
        "لا يمكن لكلمة المرور أن تكون أصغر من 8 خانات",
    "كلمة المرور وتأكيدها غير متطابقان": "كلمة المرور وتأكيدها غير متطابقان",

    //Cars Page
    "أدخل اسم السيارة هنا...": "أدخل اسم السيارة هنا...",
    "قم بالبحث عن خصائص سيارة لعرضها": "قم بالبحث عن خصائص سيارة لعرضها",
    "الفلاتر": "الفلاتر",
    "الجميع": "الجميع",
    "فئة": "فئة",
    "مدينة": "مدينة",
    "المواصفات الإقليمية": "المواصفات الإقليمية",
    "عدد الأبواب": "عدد الأبواب",
    "عدد المقاعد": "عدد المقاعد",
    "اللون الداخلي": "اللون الداخلي",
    "اللون الخارجي": "اللون الخارجي",
    "قوة الحصان": "قوة الحصان",
    "مجربة": "مجربة",
    "التأمين": "التأمين",
    "أنواع الوقود": "أنواع الوقود",
    "شروط": "شروط",
    "عنوان السيارة": "عنوان السيارة",
    "البحث عن طريق عنوان السيارة": "البحث عن طريق عنوان السيارة",
    "موقع": "موقع",
    "البحث بالموقع": "البحث بالموقع",
    "العلامات التجارية:": "العلامات التجارية:",
    "التسعير:": "التسعير:",
    "أقل سعر": "أقل سعر",
    "أعلى سعر": "أعلى سعر",
    "إعادة ضبط الجميع": "إعادة ضبط الجميع",

    //Account Page
    //
    //Main Account Page
    "إعدادات الحساب": "إعدادات الحساب",
    "اتصل بنا": "اتصل بنا",
    "الأحكام والشروط": "الأحكام والشروط",
    "سياسة الخصوصية": "سياسة الخصوصية",
    "التعليمات": "التعليمات",
    "الصور المحفوظة": "الصور المحفوظة",
    "تم حذف بيانات السيارة ولم تعد متوفّرة هل تريد حذفها لديك أيضاً":
        "تم حذف بيانات السيارة ولم تعد متوفّرة هل تريد حذفها لديك أيضاً",
    "تذاكر الدعم الفني": "تذاكر الدعم الفني",
    "تسجيل الخروج": "تسجيل الخروج",
    "تم تسجيل الخروج بنجاح": "تم تسجيل الخروج بنجاح",
    //
    //Edit Profile Page
    "تعديل بيانات الحساب": "تعديل بيانات الحساب",
    " اسم المستخدم:": " اسم المستخدم:",
    "أدخل اسم المستخدم هنا...": "أدخل اسم المستخدم هنا...",
    " الموقع:": " الموقع:",
    "أدخل موقعك هنا...": "أدخل موقعك هنا...",
    " رقم الهاتف:": " رقم الهاتف:",
    "أدخل رقم هاتفك هنا...": "أدخل رقم هاتفك هنا...",
    " كلمة المرور*:": " كلمة المرور*:",
    "أدخل كلمة المرور هنا...": "أدخل كلمة المرور هنا...",
    " كلمة المرور الجديدة:": " كلمة المرور الجديدة:",
    "تحديث البيانات": "تحديث البيانات",

    //Support Ticket
    //
    //Main Support Ticket Page
    "تذاكر الدعم الفني:": "تذاكر الدعم الفني:",
    "تسجيل تذكرة": "تسجيل تذكرة",
    "البحث عن تذكرة...": "البحث عن تذكرة...",
    "معرّف التذكرة": "معرّف التذكرة",
    "الموضوع": "الموضوع",
    "الحالة": "الحالة",
    "الرسالة": "الرسالة",
    "لا يوجد سيارات لعرضها": "لا يوجد سيارات لعرضها",
    "لا يوجد تذاكر لعرضها": "لا يوجد تذاكر لعرضها",
    //
    //Add Support Ticket Page

    "قم بإنشاء تذكرة دعم": "قم بإنشاء تذكرة دعم",
    " عنوان البريد الإلكتروني*:": " عنوان البريد الإلكتروني*:",
    "أدخل البريد الإلكتروني هنا...": "أدخل البريد الإلكتروني هنا...",
    " الموضوع*:": " الموضوع*:",
    "أدخل موضوع التذكرة هنا...": "أدخل موضوع التذكرة هنا...",
    " الرسالة*:": " الرسالة*:",
    "أدخل رسالتك هنا...": "أدخل رسالتك هنا...",
    "إرفاق ملف:": "إرفاق ملف:",
    "تحديد ملف": "تحديد ملف",
    "أقصى حجم للتحميل هو 20 ميغا بايت ويسمح فقط بملف مضغوط من نوع zip.":
        "أقصى حجم للتحميل هو 20 ميغا بايت ويسمح فقط بملف مضغوط من نوع zip.",
    "تمت إضافة ملف بنجاح ": "تمت إضافة ملف بنجاح ",
    "تقديم الطلب": "تقديم الطلب",
    "قيد المراجعة": "قيد المراجعة",
    "الرجاء ملئ الحقول المطلوبة": "الرجاء ملئ الحقول المطلوبة",

    //Car Details
    //
    "تفاصيل السيارة": "تفاصيل السيارة",
    'مجموع السيارات:': 'مجموع السيارات:',
    "المواصفات:": "المواصفات:",
    "الوصف:": "الوصف:",
    "الموقع:": "الموقع:",
    "السيارات ذات الصلة:": "السيارات ذات الصلة:",
    "اتصل بالبائع:": "اتصل بالبائع:",
    "اتصل الآن": "اتصل الآن",
    "عبر واتساب": "عبر واتساب",
    "الاسم": "الاسم",
    "عنوان البريد الإلكتروني": "عنوان البريد الإلكتروني",
    "رقم الهاتف": "رقم الهاتف",
    "رسالة...": "رسالة...",
    "إرسال الرسالة": "إرسال الرسالة",
    'اسم السيارة:': 'اسم السيارة:',
    'تصنيف السيارة:': 'تصنيف السيارة:',
    'نوع السيارة:': 'نوع السيارة:',
    'وصف السيارة:': 'وصف السيارة:',
    'السعر:': 'السعر:',
    "تمت الإضافة إلى قائمة الرغبات": "تمت الإضافة إلى قائمة الرغبات",
    "تم الحذف من قائمة الرغبات": "تم الحذف من قائمة الرغبات",
    "حفظ": "حفظ",
    "نعم": "نعم",
    "لا": "لا",
    "سنة الصنع": "سنة الصنع",
    "الأميال المقطوعة": "الأميال المقطوعة",
    "السرعة القصوى": "السرعة القصوى",
    "ماركة": "ماركة",
    "نموذج": "نموذج",
    "نوع الوقود": "نوع الوقود",
    "نوع التحويل": "نوع التحويل",
    "الرقم التسلسلي": "الرقم التسلسلي",
    "موجود": "موجود",
    "غير قابل للتنفيذ": "غير قابل للتنفيذ",
    "لا يوجد": "لا يوجد",
    "تم حفظ الصور بنجاح": "تم حفظ الصور بنجاح",
    "تم إرسال الرسالة بنجاح": "تم إرسال الرسالة بنجاح",
    "جارٍ الإرسال": "جارٍ الإرسال",
    //Vendor Page
    //
    "تفاصيل البائع": "تفاصيل البائع",
    "عنوان:": "عنوان:",
    "جميع السيارات": "جميع السيارات",
    //Extras
    //
    "اعد المحاولة": "اعد المحاولة",
    "...جارٍ التحميل": "جارٍ التحميل...",
    "...لا يوجد اتصال بالإنترنت": "لا يوجد اتصال بالإنترنت...",
    "انتهت مهلة التنفيذ": "انتهت مهلة التنفيذ",
    "حدث خطأ ما...": "حدث خطأ ما...",
    "تأكيد": "تأكيد",
    "إلغاء": "إلغاء",
    "عرض المزيد": "عرض المزيد",
    "قم بتسجيل الدخول للمتابعة": "قم بتسجيل الدخول للمتابعة",
    "تم تحديث البيانات": "تم تحديث البيانات",
  };
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
//-------------------------------------------------------English Language--------------------------------------------------------------
  static final Map<String, String> en = {
    //On Boarding
    "انطلق في رحلة سيارتك مع قائمة السيارات":
        "Go on your car trip with Al Qassem Group",
    "اكتشف سيارتك المثالية مع قائمة السيارات":
        "Discover your perfect car with Al Qassem Group",
    "خدماتنا متميزة ومتنوعة": "Our distinguished and diverse services",
    "التالي": "Next",
    "ابدأ": "Get Started!",

    //Home Page
    "التصنيفات المشهورة": "Popular Categories",
    "أفضل مركباتنا المميزة": "Our Top Featured Vehicles",
    "الخدمات التي نقدّمها": "Our Services",

    "شراء سيارة": "Car purchase",
    "نوع الخدمة: شراء سيارة\n": "Service type: Buy a car\n",
    "بيع سيارة": "Sell a car",
    "نوع الخدمة: بيع سيارة\n": "Service type: Sell a car\n",
    "تمويل بنكي": "Bank Finance",
    "نوع الخدمة: تمويل بنكي\n": "Service type: Bank finance\n",
    "تصدير سيارة": "Car export",
    "نوع الخدمة: تصدير سيارة\n": "Service type: Car export\n",
    "تأمين/ تسجيل\n ضمان": "Insurance/Registration\nWarranty",
    "نوع الخدمة: تأمين/تسجيل ضمان\n":
        "Service type: Insurance/Registration Warranty\n",
    "طلب الخدمة": "Ask for service",
    "في قائمة سيارة، نقدم مجموعة واسعة من السيارات المستعملة عالية الجودة لتلبية احتياجات قيادتك وميزانيتك. مع سنوات من الخبرة في صناعة السيارات، نفخر بتقديم خدمة عملاء استثنائية والتأكد من أن كل سيارة في قطعتنا تلبي معاييرنا الصارمة للجودة والموثوقية.":
        "At Carlist, we offer a wide selection of top-quality pre-owned vehicles to meet your driving needs and budget. With years of experience in the automotive industry.",
    "بواسطة": "By",
    "الرئيسية": "Home",
    "السيارات": "Cars",
    "معلومات عنا": "About us",
    "خدماتنا": "Our services",
    "مدوّنة": "Blog",
    "اتّصال": "Contact",
    "تسجيل الدخول": "Login",
    "اشتراك": "Signup",

    //Auth
    //
    //Login
    "اسم المستخدم": "Username",
    "كلمة المرور": "Password",
    "ليس لديك حساب؟ ": "Don't have an account? ",
    "أنقر هنا ": "Click Here ",
    "للتسجيل": "to Signup",
    "هل نسيت كلمة المرور؟": "Forgot password?",
    "تسجيل الدخول مع غوغل": "Login with Google",
    "تسجيل الدخول مع فيسبوك": "Login with Facebook",
    "التحقق من الحساب": "Email Verification",
    "الرجاء إدخال الحساب المراد استعادة كلمة المرور له في الحقل التالي:":
        "Enter the account you're trying to reset its password in the following form:",
    "أدخل الحساب هنا من فضلك...": "Please enter your account here...",
    "إرسال الرمز ": "Send OTP ",
    "إعادة تعيين كلمة المرور": "Reset password",
    "كلمة المرور الجديدة:": "New password:",
    "أدخل كلمة المرور الجديدة هنا...": "Enter your new password here...",
    "تأكيد كلمة المرور:": "Confirm password:",
    "أعد إدخال كلمة المرور الجديدة هنا...":
        "Re-enter your new password here...",
    "إعادة التعيين": "Reset",
    "تم تسجيل الدخول بنجاح": "Login successfully",
    "الرجاء التحقق من صيغة البريد الإلكتروني": "Email format is not correct",
    "إرسال الرمز مجدداً": "Re-Send OTP",
    "تم إرسال رمز التحقق بنجاح": "Otp sent successfully",
    "تمت إعادة تعيين كلمة المرور بنجاح": "Password reset successfully",
    //
    //SignUp
    "البريد الإلكتروني": "Email",
    "تأكيد كلمة المرور": "Confirm password",
    "هل لديك حساب؟ ": "Have an account ",
    "لتسجيل الدخول": "to sign in",
    "رمز التحقق": "OTP",
    "التحقق من الرمز": "OTP Check",
    "الرجاء إدخال رمز التحقق الذي أرسلناه إلى حسابك في الحقل التالي:":
        "Please enter the code that we sent to your email in the following form:",
    "تحقق من الرمز ": "Check OTP ",
    "جارٍ التحقق": "Checking data...",
    "لا يمكن لاسم المستخدم ان يكون فارغاً": "Username can not be empty",
    "لا يمكن للبريد الإلكتروني ان يكون فارغاً": "Email can not be empty",
    "لا يمكن لكلمة المرور أن تكون أصغر من 8 خانات":
        "Password must be more than 8 digit",
    "كلمة المرور وتأكيدها غير متطابقان":
        "Confirm password does not match the password",

    //Cars Page
    "أدخل اسم السيارة هنا...": "Enter car name here...",
    "قم بالبحث عن خصائص سيارة لعرضها": "Search for car data",
    "الفلاتر": "Filters",
    "الجميع": "All",
    "فئة": "Category",
    "مدينة": "City",
    "المواصفات الإقليمية": "Regional specifications",
    "عدد الأبواب": "Doors number",
    "عدد المقاعد": "Seats number",
    "اللون الداخلي": "Inside color",
    "اللون الخارجي": "Outside color",
    "قوة الحصان": "Horse power",
    "مجربة": "Tested",
    "التأمين": "Warranty",
    "أنواع الوقود": "Fuel types",
    "شروط": "Conditions",
    "عنوان السيارة": "Car Title",
    "البحث عن طريق عنوان السيارة": "Search by car title",
    "موقع": "Location",
    "البحث بالموقع": "Search by location",
    "العلامات التجارية:": "Brands:",
    "التسعير:": "Pricing:",
    "أقل سعر": "Min price",
    "أعلى سعر": "Max price",
    "إعادة ضبط الجميع": "Reset all",
    "قيم خاطئة": "Invalid password",
    //Account Page
    //
    //Main Account Page
    "إعدادات الحساب": "Edit profile",
    "اتصل بنا": "Contact us",
    "الأحكام والشروط": "Terms & Conditions",
    "سياسة الخصوصية": "Privacy policy",
    "التعليمات": "FAQ",
    "الصور المحفوظة": "Saved images",

    "تم حذف بيانات السيارة ولم تعد متوفّرة هل تريد حذفها لديك أيضاً":
        "Car data have been deleted and it's not available any more do you want to delete it from your device?",
    "تذاكر الدعم الفني": "Support tickets",
    "تسجيل الخروج": "Logout",
    "تم تسجيل الخروج بنجاح": "Logged out successfully",

    //
    //Edit Profile Page
    "تعديل بيانات الحساب": "Edit profile",
    " اسم المستخدم:": " UserName:",
    "أدخل اسم المستخدم هنا...": "Enter user name here...",
    " الموقع:": " location",
    "أدخل موقعك هنا...": "Enter your location here...",
    " رقم الهاتف:": " Phone number",
    "أدخل رقم هاتفك هنا...": "Enter your phone number here...",
    " كلمة المرور*:": " Password*:",
    "أدخل كلمة المرور هنا...": "Enter password here...",
    " كلمة المرور الجديدة:": " New password",
    "تحديث البيانات": "Update profile",

    //Support Ticket
    //
    //Main Support Ticket Page
    "تذاكر الدعم الفني:": "Support ticket:",
    "تسجيل تذكرة": "Submit a ticket",
    "البحث عن تذكرة...": "Search for ticket...",
    "معرّف التذكرة": "Ticket id",
    "الموضوع": "Subject",
    "الحالة": "Status",
    "الرسالة": "Message",
    "لا يوجد سيارات لعرضها": "No Cars are available to show",
    "لا يوجد تذاكر لعرضها": "No tickets available to show",
    "حجم الملف أكبر من الحد المسموح": "File size is larger than 20Mbs",
    //
    //Add Support Ticket Page

    "قم بإنشاء تذكرة دعم": "Create support ticket",
    " عنوان البريد الإلكتروني*:": " Email*:",
    "أدخل البريد الإلكتروني هنا...": "Enter your email here...",
    " الموضوع*:": " Subject*:",
    "أدخل موضوع التذكرة هنا...": "Enter ticket subject here...",
    " الرسالة*:": " Message*:",
    "أدخل رسالتك هنا...": "Enter your message here...",
    "إرفاق ملف:": "Attachment:",
    "تحديد ملف": "Choose file",
    "أقصى حجم للتحميل هو 20 ميغا بايت ويسمح فقط بملف مضغوط من نوع zip.":
        "Max upload size is 20 MB & only .zip file is allowed.",
    "تمت إضافة ملف بنجاح ": "the file have been added successfully",
    "تقديم الطلب": "Submit",
    "قيد المراجعة": "Under review",
    "الرجاء ملئ الحقول المطلوبة": "Please fill the required forms",

    //Car Details
    //
    "تفاصيل السيارة": "Car details",
    'مجموع السيارات:': 'Total cars:',
    "المواصفات:": "Specifications:",
    "الوصف:": "Description:",
    "الموقع:": "Location:",
    "السيارات ذات الصلة:": "Related cars:",
    "اتصل بالبائع:": "Contact vendor:",
    "اتصل الآن": "Call now",
    "عبر واتساب": "Whatsapp",
    "الاسم": "Name",
    "عنوان البريد الإلكتروني": "Email",
    "رقم الهاتف": "Phone number",
    "رسالة...": "Message...",
    "إرسال الرسالة": "Send message",
    'اسم السيارة:': 'Car name:',
    'تصنيف السيارة:': 'Car category:',
    'نوع السيارة:': 'Car type:',
    'وصف السيارة:': 'Car description:',
    'السعر:': 'Price:',
    "تمت الإضافة إلى قائمة الرغبات": "Added to wishlist successfully",
    "تم الحذف من قائمة الرغبات": "Removed from wishlist successfully",
    "حفظ": "Save",
    "نعم": "Yes",
    "لا": "No",
    "سنة الصنع": "Manufacturing year",
    "الأميال المقطوعة": "mileage",
    "السرعة القصوى": "Top speed",
    "ماركة": "Brand",
    "نموذج": "Model",
    "نوع الوقود": "Fuel type",
    "نوع التحويل": "Transmission type",
    "الرقم التسلسلي": "Serial number",
    "موجود": "Yes",
    "غير قابل للتنفيذ": "Does not apply",
    "لا يوجد": "No",
    "تم حفظ الصور بنجاح": "Images saved successfully",
    "تم إرسال الرسالة بنجاح": "Email sent successfully",
    "جارٍ الإرسال": "Sending",
    //Vendor Page
    //
    "تفاصيل البائع": "Vendor details",
    "عنوان:": "Address:",
    "جميع السيارات": "All cars",

    //Extras
    //
    "اعد المحاولة": "Retry",
    "...جارٍ التحميل": "Loading...",
    "...لا يوجد اتصال بالإنترنت": "No internet connection",
    "انتهت مهلة التنفيذ": "Time out",
    "حدث خطأ ما...": "An error has occur...",
    "تأكيد": "Confirm",
    "إلغاء": "Cancel",
    "عرض المزيد": "Show more",
    "قم بتسجيل الدخول للمتابعة": "You have to login to continue...",
    "تم تحديث البيانات": "Data has been updated",
  };
}
